---
kind: method
id: M:Autodesk.Revit.DB.DWFImportOptions.GetSheetViews
source: html/532b4d54-d4f9-1cd1-09d6-41f3b0169780.htm
---
# Autodesk.Revit.DB.DWFImportOptions.GetSheetViews Method

Get sheet views where DWF markups are imported.

## Syntax (C#)
```csharp
public IList<ElementId> GetSheetViews()
```

## Returns
An array of sheet views